hdscmcu/pack/HDSC.HC32L17X.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>HDSC</vendor>
    <name>HC32L17X</name>
    <description>HC32L17X ARM Cortex-M0+ Device Family Pack</description>
    <url>https://raw.githubusercontent.com/hdscmcu/pack/master/</url>
    <supportContact>support@hdsc.com</supportContact>
    <!-- optional license file -->
    
    <!-- 
    <license>
    </license>
    -->

    <releases>
        <release version="1.0.0" date="2018-09-10">
            Initial Version
        </release>
    </releases>

    <keywords>
        <!-- keywords for indexing -->
        <keyword>HDSC</keyword>
        <keyword>Device Support</keyword>
        <keyword>HC32L17X</keyword>
    </keywords>

  
    <devices>
        <family Dfamily="HC32L17X-Series" Dvendor="HDSC:145">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000" />
        <debugconfig type="swd" clock="1000000" />
        <description>
            The HC32L17X device family contains an ARM Cortex-M0+ processor, running up to 48 MHz with a versatile set of on-chip peripherals.
        </description>
        
        <!-- ************************  Subfamily 'HC32L176'  **************************** -->
        <subFamily DsubFamily="HC32L176">
            <processor Dclock="48000000"/>
                <!-- *************************  Device 'HC32L176PATA'  ***************************** -->
                <device Dname="HC32L176PATA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L176PATA.h"/>
                    <debug svd="SVD/HC32L176PATA.sfr"/>
                </device>
                
                <!-- *************************  Device 'HC32L176MATA'  ***************************** -->
                <device Dname="HC32L176MATA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L176MATA.h"/>
                    <debug svd="SVD/HC32L176MATA.sfr"/>
                </device>

                <!-- *************************  Device 'HC32L176KATA'  ***************************** -->
                <device Dname="HC32L176KATA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L176KATA.h"/>
                    <debug svd="SVD/HC32L176KATA.sfr"/>
                </device>

                <!-- *************************  Device 'HC32L176JATA'  ***************************** -->
                <device Dname="HC32L176JATA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L176JATA.h"/>
                    <debug svd="SVD/HC32L176JATA.sfr"/>
                </device>
                
        </subFamily>
        
        <!-- ************************  Subfamily 'HC32L170'  **************************** -->
        <subFamily DsubFamily="HC32L170">
            <processor Dclock="48000000"/>
                <!-- *************************  Device 'HC32L170JATA'  ***************************** -->
                <device Dname="HC32L170JATA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L170JATA.h"/>
                    <debug svd="SVD/HC32L170JATA.sfr"/>
                </device>
                
                <!-- *************************  Device 'HC32L170FAUA'  ***************************** -->
                <device Dname="HC32L170FAUA">
                    <memory        id="IROM1"                start="0x00000000"    size="0x20000"    startup="1"    default="1"/>
                    <memory        id="IRAM1"                start="0x20000000"    size="0x4000"    init="0"    default="1"/>
                    <algorithm  name="Flash/FlashHC32L17X_128K.FLM" start="0x00000000"  size="0x20000" default="1"/>
                    <compile header="Device/Include/HC32L170FAUA.h"/>
                    <debug svd="SVD/HC32L170FAUA.sfr"/>
                </device>
                
        </subFamily>
        
        </family>
    </devices>

  <!-- examples section (optional for all Software Packs)-->
  <!--
  <examples>
  </examples>
  -->
  
  <!-- conditions section (optional for all Software Packs)-->
    
    <conditions>
        <!-- Compiler Conditions -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
        
        <!-- Device Conditions -->
        <condition id="HC32L17X">
            <description>HDSC HC32L17X Device</description>
            <require Dvendor="HDSC:145" Dname="HC32L17*"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        
         <!-- P/N Conditions -->
        <condition id = "HC32L176PATA">
            <require Dname="HC32L176PATA"/>
        </condition>
        <condition id = "HC32L176MATA">
            <require Dname="HC32L176MATA"/>
        </condition>
        <condition id = "HC32L176KATA">
            <require Dname="HC32L176KATA"/>
        </condition>
        <condition id = "HC32L176JATA">
            <require Dname="HC32L176JATA"/>
        </condition>
        <condition id = "HC32L170JATA">
            <require Dname="HC32L170JATA"/>
        </condition>
        <condition id = "HC32L170FAUA">
            <require Dname="HC32L170FAUA"/>
        </condition>
        
        <!-- Device + CMSIS Conditions -->
        <condition id="HC32L17X CMSIS">
            <description>HDSC HC32L17X Series devices and CMSIS-CORE</description>
            <require condition="HC32L17X"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>        
    </conditions>

  
  <!-- component section (optional for all Software Packs)-->

    <components>
        <!-- Startup HC32L17X -->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HC32L17X CMSIS">
        <description>System Startup for HC32L17X series</description>
        <files>
            <!-- include folder -->
            <file category="include" name="Device/Include/"/>
            <file category="header" name="Device/Include/HC32L176PATA.h" condition="HC32L176PATA" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/HC32L176MATA.h" condition="HC32L176MATA" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/HC32L176KATA.h" condition="HC32L176KATA" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/HC32L176JATA.h" condition="HC32L176JATA" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/HC32L170JATA.h" condition="HC32L170JATA" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/HC32L170FAUA.h" condition="HC32L170FAUA" attr="config" version="1.0.0"/>
            
            <!-- startup file -->
            <file category="source" name="Device/Source/ARM/startup_hc32l17x.s" attr="config" condition="Compiler ARMCC" version="1.0.0"/>
            
            <!-- system file -->
            <file category="source" name="Device/Source/system_hc32l17x.c" attr="config" version="1.0.0"/>
            <file category="header" name="Device/Include/system_hc32l17x.h" attr="config" version="1.0.0"/>
        </files>
        </component>
    </components>

</package>
